# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArray..::..Append Method
FormArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Form item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Form _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Form^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..Form
# See Also
FormArray Class
Autodesk.Revit.DB Namespace